## Terraform Tests — PR Summary

| Step | Result |
|------|--------|
| Format | ✅ |
| Init | ✅ |
| Validate | ✅ |
| Plan | ✅ |

<details><summary>Plan output</summary>

```
Acquiring state lock. This may take a few moments...
module.cloud_function.data.archive_file.function_source: Reading...
module.cloud_function.data.archive_file.function_source: Read complete after 0s [id=d429d24ccb284370e36071b53e29ea3a2eaa5ab6]
module.iam.google_project_iam_member.github_actions_cloudrun_sa_user: Refreshing state... [id=hikes-482104/roles/iam.serviceAccountUser/serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com]
module.apis.google_project_service.secretmanager: Refreshing state... [id=hikes-482104/secretmanager.googleapis.com]
module.iam.google_project_iam_member.github_actions_terraform_sa_user: Refreshing state... [id=hikes-482104/roles/iam.serviceAccountUser/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.apis.google_project_service.firestore: Refreshing state... [id=hikes-482104/firestore.googleapis.com]
module.cloud_function.google_service_account.function: Refreshing state... [id=projects/hikes-482104/serviceAccounts/scrape-recipe-function@hikes-482104.iam.gserviceaccount.com]
google_storage_bucket.tfstate: Refreshing state... [id=e5092a6f6c6925d1-bucket-tfstate]
module.apis.google_project_service.artifactregistry: Refreshing state... [id=hikes-482104/artifactregistry.googleapis.com]
module.apis.google_project_service.run: Refreshing state... [id=hikes-482104/run.googleapis.com]
module.cloud_function.google_storage_bucket.function_source: Refreshing state... [id=hikes-482104-function-source]
module.workload_federation.google_iam_workload_identity_pool.github: Refreshing state... [id=projects/hikes-482104/locations/global/workloadIdentityPools/github-actions]
module.apis.google_project_service.cloudbuild: Refreshing state... [id=hikes-482104/cloudbuild.googleapis.com]
module.apis.google_project_service.firebase: Refreshing state... [id=hikes-482104/firebase.googleapis.com]
module.apis.google_project_service.iamcredentials: Refreshing state... [id=hikes-482104/iamcredentials.googleapis.com]
module.cloud_run.google_service_account.api: Refreshing state... [id=projects/hikes-482104/serviceAccounts/meal-planner-api@hikes-482104.iam.gserviceaccount.com]
module.apis.google_project_service.cloudresourcemanager: Refreshing state... [id=hikes-482104/cloudresourcemanager.googleapis.com]
module.apis.google_project_service.cloudfunctions: Refreshing state... [id=hikes-482104/cloudfunctions.googleapis.com]
module.apis.google_project_service.iam: Refreshing state... [id=hikes-482104/iam.googleapis.com]
module.cloud_run.google_project_iam_member.firebase_auth: Refreshing state... [id=hikes-482104/roles/firebaseauth.viewer/serviceAccount:meal-planner-api@hikes-482104.iam.gserviceaccount.com]
module.apis.google_project_service.identitytoolkit: Refreshing state... [id=hikes-482104/identitytoolkit.googleapis.com]
module.cloud_run.google_project_iam_member.firestore_user: Refreshing state... [id=hikes-482104/roles/datastore.user/serviceAccount:meal-planner-api@hikes-482104.iam.gserviceaccount.com]
module.workload_federation.google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/hikes-482104/locations/global/workloadIdentityPools/github-actions/providers/github-provider]
module.apis.google_project_service.storage: Refreshing state... [id=hikes-482104/storage.googleapis.com]
module.cloud_function.google_storage_bucket_object.function_source: Refreshing state... [id=hikes-482104-function-source-scrape_recipe-e674d321998fa88758edd91ae9df4117.zip]
module.firebase.google_firebase_project.default: Refreshing state... [id=projects/hikes-482104]
module.firestore.google_secret_manager_secret.database_name: Refreshing state... [id=projects/hikes-482104/secrets/meal-planner-database-name]
module.firebase.google_secret_manager_secret.oauth_client_id: Refreshing state... [id=projects/hikes-482104/secrets/meal-planner_oauth_client_id]
module.artifact_registry.google_artifact_registry_repository.api: Refreshing state... [id=projects/hikes-482104/locations/europe-west1/repositories/meal-planner]
module.firebase.google_secret_manager_secret.github_expo_public_firebase_app_id: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_APP_ID]
module.firebase.google_secret_manager_secret.github_expo_public_firebase_messaging_sender_id: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_MESSAGING_SENDER_ID]
module.firebase.google_secret_manager_secret.oauth_client_secret: Refreshing state... [id=projects/hikes-482104/secrets/meal-planner_oauth_client_secret]
module.secrets.google_secret_manager_secret.gemini_api_key: Refreshing state... [id=projects/hikes-482104/secrets/gemini-api-key]
module.firebase.google_secret_manager_secret.github_expo_public_api_url: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_API_URL]
module.firestore.google_secret_manager_secret.project_id: Refreshing state... [id=projects/hikes-482104/secrets/meal-planner-project-id]
module.firebase.google_secret_manager_secret.github_expo_public_firebase_api_key: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_API_KEY]
module.iam.google_service_account.github_actions_firebase: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.iam.google_service_account.local_dev: Refreshing state... [id=projects/hikes-482104/serviceAccounts/local-dev@hikes-482104.iam.gserviceaccount.com]
module.iam.google_service_account.github_actions_terraform: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.cloud_function.google_cloudfunctions2_function.scrape_recipe: Refreshing state... [id=projects/hikes-482104/locations/europe-west1/functions/scrape-recipe]
module.iam.google_service_account.github_actions_cloudrun: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_binding.prerequisite_roles["roles/iam.roleAdmin"]: Refreshing state... [id=hikes-482104/roles/iam.roleAdmin]
module.iam.google_project_iam_binding.prerequisite_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=hikes-482104/roles/resourcemanager.projectIamAdmin]
module.firebase.data.google_secret_manager_secret_version.oauth_client_id[0]: Reading...
module.firebase.data.google_secret_manager_secret_version.oauth_client_secret[0]: Reading...
module.firestore.google_secret_manager_secret_version.project_id: Refreshing state... [id=projects/666169448126/secrets/meal-planner-project-id/versions/1]
module.iam.google_project_iam_member.github_actions_firebase_secretmanager: Refreshing state... [id=hikes-482104/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_firebase_hosting: Refreshing state... [id=hikes-482104/roles/firebasehosting.admin/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.local_dev_firestore: Refreshing state... [id=hikes-482104/roles/datastore.user/serviceAccount:local-dev@hikes-482104.iam.gserviceaccount.com]
module.firebase.data.google_secret_manager_secret_version.oauth_client_id[0]: Read complete after 0s [id=projects/666169448126/secrets/meal-planner_oauth_client_id/versions/1]
module.firebase.data.google_secret_manager_secret_version.oauth_client_secret[0]: Read complete after 0s [id=projects/666169448126/secrets/meal-planner_oauth_client_secret/versions/1]
module.iam.google_project_iam_member.local_dev_secrets: Refreshing state... [id=hikes-482104/roles/secretmanager.secretAccessor/serviceAccount:local-dev@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.local_dev_storage: Refreshing state... [id=hikes-482104/roles/storage.objectUser/serviceAccount:local-dev@hikes-482104.iam.gserviceaccount.com]
module.firebase.google_firebase_hosting_site.default: Refreshing state... [id=projects/hikes-482104/sites/hikes-482104]
module.firebase.google_firebase_web_app.mobile: Refreshing state... [id=projects/hikes-482104/webApps/1:666169448126:web:1846118c5a674cd3acb0ef]
module.iam.google_project_iam_member.github_actions_terraform_sa_admin: Refreshing state... [id=hikes-482104/roles/iam.serviceAccountAdmin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_secrets: Refreshing state... [id=hikes-482104/roles/secretmanager.admin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_wif: Refreshing state... [id=hikes-482104/roles/iam.workloadIdentityPoolAdmin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_project_iam: Refreshing state... [id=hikes-482104/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_firebase: Refreshing state... [id=hikes-482104/roles/firebase.admin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_iam_admin: Refreshing state... [id=hikes-482104/roles/iam.roleAdmin/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_terraform_editor: Refreshing state... [id=hikes-482104/roles/editor/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_cloudrun_admin: Refreshing state... [id=hikes-482104/roles/run.admin/serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_member.github_actions_cloudrun_artifact_registry: Refreshing state... [id=hikes-482104/roles/artifactregistry.writer/serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_custom_role.app_user: Refreshing state... [id=projects/hikes-482104/roles/mealPlannerAppUser]
module.iam.google_project_iam_custom_role.infrastructure_manager: Refreshing state... [id=projects/hikes-482104/roles/mealPlannerInfraManager]
module.cloud_run.google_secret_manager_secret_iam_member.gemini_api_key[0]: Refreshing state... [id=projects/hikes-482104/secrets/gemini-api-key/roles/secretmanager.secretAccessor/serviceAccount:meal-planner-api@hikes-482104.iam.gserviceaccount.com]
module.firebase.google_secret_manager_secret_version.github_expo_public_firebase_app_id: Refreshing state... [id=projects/666169448126/secrets/github_EXPO_PUBLIC_FIREBASE_APP_ID/versions/1]
module.firebase.data.google_firebase_web_app_config.mobile: Reading...
module.cloud_function.google_cloud_run_v2_service_iam_member.public[0]: Refreshing state... [id=projects/hikes-482104/locations/europe-west1/services/scrape-recipe/roles/run.invoker/allUsers]
module.firebase.google_secret_manager_secret_iam_member.github_actions_firebase_messaging_sender_id[0]: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_MESSAGING_SENDER_ID/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.firebase.google_secret_manager_secret_iam_member.github_actions_api_url[0]: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_API_URL/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.firebase.google_secret_manager_secret_iam_member.github_actions_firebase_api_key[0]: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_API_KEY/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.firebase.google_secret_manager_secret_iam_member.github_actions_oauth_client_id[0]: Refreshing state... [id=projects/hikes-482104/secrets/meal-planner_oauth_client_id/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.firebase.data.google_firebase_web_app_config.mobile: Read complete after 0s [id=1:666169448126:web:1846118c5a674cd3acb0ef]
module.firebase.google_secret_manager_secret_iam_member.github_actions_firebase_app_id[0]: Refreshing state... [id=projects/hikes-482104/secrets/github_EXPO_PUBLIC_FIREBASE_APP_ID/roles/secretmanager.secretAccessor/serviceAccount:github-actions-firebase@hikes-482104.iam.gserviceaccount.com]
module.iam.google_project_iam_binding.user_access["roles/viewer"]: Refreshing state... [id=hikes-482104/roles/viewer]
module.iam.google_project_iam_binding.user_access["projects/hikes-482104/roles/mealPlannerAppUser"]: Refreshing state... [id=hikes-482104/projects/hikes-482104/roles/mealPlannerAppUser]
module.iam.google_project_iam_binding.user_access["projects/hikes-482104/roles/mealPlannerInfraManager"]: Refreshing state... [id=hikes-482104/projects/hikes-482104/roles/mealPlannerInfraManager]
module.workload_federation.google_service_account_iam_member.workload_identity_user["terraform"]: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-terraform@hikes-482104.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/666169448126/locations/global/workloadIdentityPools/github-actions/attribute.repository/SkaneTrails/meal-planner]
module.workload_federation.google_service_account_iam_member.workload_identity_user["cloudrun"]: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/666169448126/locations/global/workloadIdentityPools/github-actions/attribute.repository/SkaneTrails/meal-planner]
module.workload_federation.google_service_account_iam_member.workload_identity_user["firebase"]: Refreshing state... [id=projects/hikes-482104/serviceAccounts/github-actions-firebase@hikes-482104.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/666169448126/locations/global/workloadIdentityPools/github-actions/attribute.repository/SkaneTrails/meal-planner]
module.firebase.google_secret_manager_secret_version.github_expo_public_firebase_messaging_sender_id: Refreshing state... [id=projects/666169448126/secrets/github_EXPO_PUBLIC_FIREBASE_MESSAGING_SENDER_ID/versions/1]
module.firebase.google_secret_manager_secret_version.github_expo_public_firebase_api_key: Refreshing state... [id=projects/666169448126/secrets/github_EXPO_PUBLIC_FIREBASE_API_KEY/versions/1]
module.firebase.google_identity_platform_config.auth: Refreshing state... [id=projects/hikes-482104/config]
module.storage.google_storage_bucket.recipe_images: Refreshing state... [id=hikes-482104-recipe-images]
module.storage.google_storage_bucket_iam_member.public_read: Refreshing state... [id=b/hikes-482104-recipe-images/roles/storage.objectViewer/allUsers]
module.cloud_run.google_storage_bucket_iam_member.api_storage_admin[0]: Refreshing state... [id=b/hikes-482104-recipe-images/roles/storage.objectAdmin/serviceAccount:meal-planner-api@hikes-482104.iam.gserviceaccount.com]
module.cloud_run.google_cloud_run_v2_service.api: Refreshing state... [id=projects/hikes-482104/locations/europe-west1/services/meal-planner-api]
module.firebase.google_identity_platform_default_supported_idp_config.google[0]: Refreshing state... [id=projects/hikes-482104/defaultSupportedIdpConfigs/google.com]
module.firestore.google_firestore_database.meal_planner: Refreshing state... [id=projects/hikes-482104/databases/meal-planner]
module.cloud_run.google_cloud_run_v2_service_iam_member.public[0]: Refreshing state... [id=projects/hikes-482104/locations/europe-west1/services/meal-planner-api/roles/run.invoker/allUsers]
module.firebase.google_secret_manager_secret_version.github_expo_public_api_url: Refreshing state... [id=projects/666169448126/secrets/github_EXPO_PUBLIC_API_URL/versions/1]
module.firestore.google_secret_manager_secret_version.database_name: Refreshing state... [id=projects/666169448126/secrets/meal-planner-database-name/versions/1]
module.firestore.google_firestore_index.recipes_by_diet_label: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgOi3kJAK]
module.firestore.google_firestore_index.meal_plans_by_week: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/meal_plans/indexes/CICAgJiUpsMI]
module.firebase.google_firestore_document.superuser["caterina.bonazzi@ingka.ikea.com"]: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/documents/superusers/caterina.bonazzi@ingka.ikea.com]
module.firestore.google_firestore_index.recipes_by_category: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgOjXh4EL]
module.firestore.google_firestore_index.recipes_by_household: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgJjmiJEK]
module.firebase.google_firestore_document.superuser["daniel.dahlberg@ingka.ikea.com"]: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/documents/superusers/daniel.dahlberg@ingka.ikea.com]
module.firestore.google_firestore_index.recipes_by_visibility: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgJjF9oIK]
module.firestore.google_firestore_index.recipes_shared_not_owned: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgJj7z4EK]
module.firestore.google_firestore_index.recipes_by_cuisine: Refreshing state... [id=projects/hikes-482104/databases/meal-planner/collectionGroups/recipes/indexes/CICAgJim14AJ]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.artifact_registry.google_artifact_registry_repository.api has changed
  ~ resource "google_artifact_registry_repository" "api" {
        id                     = "projects/hikes-482104/locations/europe-west1/repositories/meal-planner"
        name                   = "meal-planner"
      ~ update_time            = "2026-02-09T15:54:06.461979Z" -> "2026-02-09T21:21:45.453104Z"
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.firestore.google_firestore_database.meal_planner has changed
  ~ resource "google_firestore_database" "meal_planner" {
      ~ earliest_version_time             = "2026-02-09T16:57:39.914191Z" -> "2026-02-09T21:12:17.151154Z"
      ~ etag                              = "IIa23//9zJIDMOOWuvrRsZID" -> "IM37v/S2zZIDMOOWuvrRsZID"
        id                                = "projects/hikes-482104/databases/meal-planner"
        name                              = "meal-planner"
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_service_account_iam_member.cloudrun_sa_user_on_api will be created
  + resource "google_service_account_iam_member" "cloudrun_sa_user_on_api" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/hikes-482104/serviceAccounts/meal-planner-api@hikes-482104.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.terraform_sa_user_on_api will be created
  + resource "google_service_account_iam_member" "terraform_sa_user_on_api" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/hikes-482104/serviceAccounts/meal-planner-api@hikes-482104.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.terraform_sa_user_on_function will be created
  + resource "google_service_account_iam_member" "terraform_sa_user_on_function" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/hikes-482104/serviceAccounts/scrape-recipe-function@hikes-482104.iam.gserviceaccount.com"
    }

  # google_storage_bucket.tfstate will be destroyed
  # (because google_storage_bucket.tfstate is not in configuration)
  - resource "google_storage_bucket" "tfstate" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "e5092a6f6c6925d1-bucket-tfstate" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "e5092a6f6c6925d1-bucket-tfstate" -> null
      - project                     = "hikes-482104" -> null
      - project_number              = 666169448126 -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/e5092a6f6c6925d1-bucket-tfstate" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2026-01-29T20:50:51.176Z" -> null
      - uniform_bucket_level_access = true -> null
      - updated                     = "2026-01-29T20:50:51.176Z" -> null
      - url                         = "gs://e5092a6f6c6925d1-bucket-tfstate" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2026-01-29T20:50:51.176Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.cloud_function.google_cloudfunctions2_function.scrape_recipe will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scrape_recipe" {
        id               = "projects/hikes-482104/locations/europe-west1/functions/scrape-recipe"
        name             = "scrape-recipe"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "scrape_recipe-e674d321998fa88758edd91ae9df4117.zip" -> "scrape_recipe-c6ac59ad62f52cdc12793988af873998.zip"
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cloud_function.google_storage_bucket_object.function_source must be replaced
-/+ resource "google_storage_bucket_object" "function_source" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "5f2r9g==" -> (known after apply)
      ~ detect_md5hash      = "5nTTIZmPqIdY7dka6d9BFw==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1770651343035234 -> (known after apply)
      ~ id                  = "hikes-482104-function-source-scrape_recipe-e674d321998fa88758edd91ae9df4117.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "5nTTIZmPqIdY7dka6d9BFw==" -> (known after apply)
      ~ md5hexhash          = "e674d321998fa88758edd91ae9df4117" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/hikes-482104-function-source/o/scrape_recipe-e674d321998fa88758edd91ae9df4117.zip?generation=1770651343035234&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "scrape_recipe-e674d321998fa88758edd91ae9df4117.zip" -> "scrape_recipe-c6ac59ad62f52cdc12793988af873998.zip" # forces replacement
      ~ output_name         = "scrape_recipe-e674d321998fa88758edd91ae9df4117.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/hikes-482104-function-source/o/scrape_recipe-e674d321998fa88758edd91ae9df4117.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.cloud_run.google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
      - client                  = "gcloud" -> null
      - client_version          = "552.0.0" -> null
        id                      = "projects/hikes-482104/locations/europe-west1/services/meal-planner-api"
        name                    = "meal-planner-api"
        # (32 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "europe-west1-docker.pkg.dev/hikes-482104/meal-planner/meal-planner-api:bee2625051cdd98fb0895508abce0897246e163d" -> "europe-west1-docker.pkg.dev/hikes-482104/meal-planner/meal-planner-api:latest"
                name           = null
                # (6 unchanged attributes hidden)

                # (10 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.iam.google_project_iam_member.github_actions_cloudrun_sa_user will be destroyed
  # (because google_project_iam_member.github_actions_cloudrun_sa_user is not in configuration)
  - resource "google_project_iam_member" "github_actions_cloudrun_sa_user" {
      - etag    = "BwZKarrcP+Q=" -> null
      - id      = "hikes-482104/roles/iam.serviceAccountUser/serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:github-actions-cloudrun@hikes-482104.iam.gserviceaccount.com" -> null
      - project = "hikes-482104" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # module.iam.google_project_iam_member.github_actions_terraform_iam_admin will be created
  + resource "google_project_iam_member" "github_actions_terraform_iam_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com"
      + project = "hikes-482104"
      + role    = "roles/iam.roleAdmin"
    }

  # module.iam.google_project_iam_member.github_actions_terraform_project_iam will be created
  + resource "google_project_iam_member" "github_actions_terraform_project_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com"
      + project = "hikes-482104"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.iam.google_project_iam_member.github_actions_terraform_sa_user will be destroyed
  # (because google_project_iam_member.github_actions_terraform_sa_user is not in configuration)
  - resource "google_project_iam_member" "github_actions_terraform_sa_user" {
      - etag    = "BwZKarrcP+Q=" -> null
      - id      = "hikes-482104/roles/iam.serviceAccountUser/serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:github-actions-terraform@hikes-482104.iam.gserviceaccount.com" -> null
      - project = "hikes-482104" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

Plan: 6 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by @DanielDahlberg77, commit `056843b`*